Catalogs/ДанныеСотрудникаВPDM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДанныеСотрудникаВPDM</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Enabled</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Username</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДанныеСотрудникаВPDM/Ext/ManagerModule.bsl
//	    стПараметры  Структура("Ссылка,EnabledPDM,UserID,Username")
&НаСервере
Процедура ЗаписатьСотрудникPDM(стПараметры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеСотрудникаВPDM.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДанныеСотрудникаВPDM КАК ДанныеСотрудникаВPDM
		|ГДЕ
		|	ДанныеСотрудникаВPDM.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", стПараметры.Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		обДанные = Справочники.ДанныеСотрудникаВPDM.СоздатьЭлемент();
	Иначе
		Пока Выборка.Следующий() Цикл
			обДанные = Выборка.Ссылка.ПолучитьОбъект(); 
		КонецЦикла;
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(обДанные,стПараметры);
	
	обДанные.Записать();
	
КонецПроцедуры // ЗаписатьПСотрудникPDM()

&НаСервере
Функция ПолучитьДанныеСотрудникаДляPDM(мСотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеСотрудникаВPDM.UserID КАК UserID,
		|	ДанныеСотрудникаВPDM.Username КАК Username,
		|	ДанныеСотрудникаВPDM.Enabled КАК Enabled,
		|	ДанныеСотрудникаВPDM.Сотрудник КАК Сотрудник,
		|	ДанныеСотрудникаВPDM.Ссылка КАК ДанныеСотрудникаВPDM
		|ИЗ
		|	Справочник.ДанныеСотрудникаВPDM КАК ДанныеСотрудникаВPDM
		|ГДЕ
		|	ДанныеСотрудникаВPDM.Сотрудник В(&мСотрудник)";
	
	Запрос.УстановитьПараметр("мСотрудник", мСотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Тип("Массив") = ТипЗнч(мСотрудник) Тогда
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	стВозврата = Новый Структура("UserID, Username, Enabled, ДанныеСотрудникаВPDM", 0, "", Ложь, Неопределено);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата,Выборка);
	КонецЦикла; 
	
	
    Возврат стВозврата;
КонецФункции // ПолучитьДанныеСотрудникаДляPDM()
